app/views/teams/index.erb

SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = ?  [["user_id", 1]]
---

    <% @user.teams.each do |t| %>