app/views/trips/_form.erb

                                            <p></p>
                                            <%= f.collection_select :flight_id, Flight.all, :id, :flight_full_info %></h6>
---
SELECT "flights".* FROM "flights"