app/views/trips/edit.erb

SELECT "flights".* FROM "flights"
---
        <%= f.label "Change Flight:" %>
        <%= f.collection_select :flight_id, Flight.all, :id, :flight_number %>