app/views/trips/index.erb


    <% @user.trips.each do |t| %>
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 1]]