app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights" WHERE (flight_number = 'CX897')
---
    def index
        if params[:from_city]
            @flights = Flight.city_search(params[:from_city])
        else
            @flights = Flight.all

SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_flight
        @flight = Flight.find_by(id: params[:id])