app/controllers/sessions_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Yinghui Gan"], ["LIMIT", 1]]
---
    def create_with_fb
        @user = User.find_or_create_by(username: fb_auth['info']['name']) do |u|