app/controllers/teams_controller.rb

    def index
        if params[:user_id]
            @user = User.find(params[:user_id])
            @teams = User.find(params[:user_id]).teams
        else
            @teams = Team.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = ?  [["user_id", 1]]
SELECT "teams".* FROM "teams"

    def new
        if params[:user_id]
            @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        if params[:user_id]
            @user = User.find_by(id: params[:user_id])
            @team = @user.teams.new(team_params)
            if @team.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "teams" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test Team1"], ["user_id", 1], ["created_at", "2021-03-30 16:51:22.181667"], ["updated_at", "2021-03-30 16:51:22.181667"]]

    def edit
        if params[:user_id]
            @user = User.find_by(id: params[:user_id])
            @team = @user.teams.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = ? AND "teams"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]