app/controllers/trips_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 1]]
---
    def index
        if params[:traveler_first_name]
            @trips = Trip.trip_search(params[:traveler_first_name])
            @user = User.find(params[:user_id])
        elsif params[:user_id]
            @user = User.find(params[:user_id])
            @trips = User.find(params[:user_id]).trips
        else
            @trips = Trip.all

SELECT "flights".* FROM "flights" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def new
        #
        if params[:flight_id]
            @flight = Flight.find_by(params[:flight_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
    def show
        #
        @user = User.find(params[:user_id])
        @trip = Trip.find_by(id: params[:id])

INSERT INTO "trips" ("user_id", "flight_id", "traveler_first_name", "traveler_last_name", "traveler_gender", "traveler_contact_info", "seat", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        #
        @trip = Trip.new(trip_params)
        @trip.user = current_user
        @trip.flight_id = params[:flight_id]
        if @trip.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ? AND "trips"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
    def edit
        if params[:user_id]
            @user = User.find_by(id: params[:user_id])
            @trip = @user.trips.find_by(id: params[:id])
        else
            @trip = Trip.find_by(id: params[:id])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "trips" SET "flight_id" = ?, "seat" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["flight_id", 10], ["seat", ""], ["updated_at", "2021-04-01 20:04:52.225941"], ["id", 1]]
---
    def update
        @trip = Trip.find_by(id: params[:id])
        if @trip.update(trip_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 2]]
---
    def destroy
        @user = User.find_by(id: params[:user_id])
        @trip = Trip.find_by(id: params[:id])
        @trip.delete