app/controllers/trips_controller.rb

UPDATE "trips" SET "traveler_last_name" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["traveler_last_name", "Tes"], ["updated_at", "2021-04-01 21:14:35.769831"], ["id", 5]]
INSERT INTO "trips" ("user_id", "flight_id", "traveler_first_name", "traveler_last_name", "traveler_gender", "traveler_contact_info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        # if params[:user_id]
        #     @user = User.find_by(id: params[:user_id])
        #     @trip = @user.trips.new(trip_params)
        #     if @trip.save
        #         redirect_to user_trips_path
        #     else
        #         render :new
        #     end
        # else
        #    redirect_to '/'
        # end
        binding.pry
        @trip = Trip.create(trip_params)
        @trip.user = current_user
        @trip.flight_id = params[:flight_id]
        @trip.save